tap "caarlos0/tap"
tap "chef/chef"
tap "getantibody/tap"
tap "go-delve/delve"
tap "goreleaser/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "nektos/tap"
tap "neovim/neovim"
tap "valelint/vale"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Record and share terminal sessions
brew "asciinema"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Official Amazon AWS command-line interface
brew "awscli"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext", link: true
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Cleans up old and inactive forks on your GitHub account
brew "fork-cleaner"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU debugger
brew "gdb"
# GIF image/animation creator/editor
brew "gifsicle"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# GPG key agent
brew "gpg-agent"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Curl statistics made simple
brew "httpstat"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# malloc implementation emphasizing fragmentation avoidance
brew "jemalloc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Production Grade K8s Installation, Upgrades, and Management
brew "kops"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# The Kubernetes package manager
brew "kubernetes-helm"
# YAML Parser
brew "libyaml"
# Java-based project management
brew "maven"
# Scalable distributed version control system
brew "mercurial"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Service monitoring system and time series database
brew "prometheus"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Standard unix software packaging tool
brew "rpm"
# The Rust toolchain installer
brew "rustup-init"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Package any app for every Linux desktop, server, cloud or device
brew "snapcraft"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Simplified and community-driven man pages
brew "tldr"
# Command-line client for Travis CI
brew "travis"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# HTTP load testing tool and library
brew "vegeta"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Binary diff, differential compression tools
brew "xdelta"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Clone all repos of a github organization
brew "caarlos0/tap/clone-org"
# quickly ssh into gcloud instances
brew "caarlos0/tap/gssh"
# Like gofmt, but for JSON files
brew "caarlos0/tap/jsonfmt"
# Little helper to run Rancher Lab's k3s in Docker
brew "caarlos0/tap/k3d"
# 
brew "caarlos0/tap/karmahub"
# Get the contributor stats summary from all repos of any given organization
brew "caarlos0/tap/org-stats"
# 
brew "caarlos0/tap/svu"
# The fastest shell plugin manager
brew "getantibody/tap/antibody"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Run GitHub Actions locally
brew "nektos/tap/act"
# A customizable, syntax-aware linter for prose.
brew "valelint/vale/vale"
cask "1password"
cask "airflow"
cask "appcleaner"
cask "couchbase-server-community"
cask "discord"
cask "disk-inventory-x"
cask "docker"
cask "fantastical"
cask "font-anonymous-pro"
cask "font-firacode-nerd-font"
cask "font-firacode-nerd-font-mono"
cask "google-chrome"
cask "google-cloud-sdk"
cask "intellij-idea-ce"
cask "iterm2-beta"
cask "java"
cask "keepingyouawake"
cask "keybase"
cask "kindle"
cask "lastpass"
cask "monodraw"
cask "ngrok"
cask "notion"
cask "now"
cask "postgres"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "skype"
cask "slack"
cask "slate"
cask "spotify"
cask "steam"
cask "subtitles"
cask "suspicious-package"
cask "telegram"
cask "transmission"
cask "vagrant"
cask "vanilla"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "webpquicklook"
cask "whatsapp"
cask "chef/chef/chefdk"
