tap "caarlos0/tap"
tap "charmbracelet/tap"
tap "github/gh"
tap "golangci/tap"
tap "goreleaser/tap"
tap "heroku/brew"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "muesli/tap"
tap "superfly/tap"
tap "teamookla/speedtest"
# YAML Parser
brew "libyaml"
# Command-line interface for SQLite
brew "sqlite"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Record and share terminal sessions
brew "asciinema"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line DNS client
brew "dog"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Foreman in Go for Procfile-based application management
brew "forego"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Stricter gofmt
brew "gofumpt"
# Fast linters runner for Go
brew "golangci-lint"
# Version Control Visualization Tool
brew "gource"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# GNU grep, egrep and fgrep
brew "grep"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Curl statistics made simple
brew "httpstat"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run Rancher Lab's k3s in Docker
brew "k3d"
# Utility to create k3s clusters on any local or remote VM
brew "k3sup"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Remote terminal application
brew "mosh"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Apache Parquet command-line tools and utilities
brew "parquet-tools"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Show ps output as a tree
brew "pstree"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tool to work with .snap files
brew "snap"
# Package any app for every Linux desktop, server, cloud or device
brew "snapcraft"
# Cross-shell prompt for astronauts
brew "starship"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# HTTP load testing tool and library
brew "vegeta"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Clone all repos of a GitHub user or organization
brew "caarlos0/tap/clone-org"
# Cleans up old and inactive forks on your github account.
brew "caarlos0/tap/fork-cleaner"
# quickly ssh into gcloud instances
brew "caarlos0/tap/gssh"
# Like gofmt, but for JSON files
brew "caarlos0/tap/jsonfmt"
# kubectx and kubens are power tools for kubectl
brew "caarlos0/tap/kubectx"
# Get the contributor stats summary from all repos of any given organization
brew "caarlos0/tap/org-stats"
# Semantic Version Utility
brew "caarlos0/tap/svu"
# Task Timer (tt) is a dead simple TUI task timer
brew "caarlos0/tap/tt"
# Manage your Charm account and encrypt/decrypt data
brew "charmbracelet/tap/charm"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser/tap/goreleaser-pro"
# nFPM is a simple, 0-dependencies, deb, rpm and apk packager.
brew "goreleaser/tap/nfpm"
# Smart little CLI helper for git projects
brew "muesli/tap/gitty"
# Your personal markdown scribe with template-engine and Git(Hub) & RSS powers
brew "muesli/tap/markscribe"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# Watch local content on Apple TV and Chromecast
cask "airflow"
# GPU-accelerated terminal emulator
cask "alacritty"
cask "deckset"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-nerd-font"
# Go (golang) IDE
cask "goland"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Tool to optimize images to a smaller size
cask "imageoptim"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2-beta"
cask "java"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# End-to-end encryption software
cask "keybase"
# Interface for reading and syncing eBooks
cask "kindle"
# Music services manager
cask "lastfm"
# App to manage software development and track bugs
cask "linear-linear"
# Software for Logitech devices
cask "logitech-options"
# Tool to create text-based art
cask "monodraw"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Create deployments right from the tray menu
cask "now"
cask "postgres"
# GUI client for PostgreSQL databases
cask "postico"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Monitors the computer system and optimizes its performance
cask "sensei"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Automatically downloads subtitles movies and TV shows
cask "subtitles"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Desktop client for WhatsApp
cask "whatsapp"
