tap "caarlos0/tap"
tap "chef/chef"
tap "clojure/tools"
tap "github/gh"
tap "golangci/tap"
tap "goreleaser/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Record and share terminal sessions
brew "asciinema"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Development kit for the Java programming language
brew "openjdk@11"
# Google's own build tool
brew "bazel"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Foreman in Go for Procfile-based application management
brew "forego"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# GPG key agent
brew "gpg-agent"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# Kubernetes package manager
brew "helm"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Improved top (interactive process viewer)
brew "htop"
# Curl statistics made simple
brew "httpstat"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Little helper to run Rancher Lab's k3s in Docker
brew "k3d"
# Helps audit your Kubernetes clusters against common security controls
brew "kubeaudit"
# YAML Parser
brew "libyaml"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# 'traceroute' and 'ping' in a single tool
brew "mtr", link: false
# NCurses Disk Usage
brew "ncdu"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Show ps output as a tree
brew "pstree"
# Emulator for x86 and PowerPC
brew "qemu"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup-init"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tool to work with .snap files
brew "snap"
# Package any app for every Linux desktop, server, cloud or device
brew "snapcraft"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extract, view, and test RAR archives
brew "unrar"
# HTTP load testing tool and library
brew "vegeta"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Cleans up old and inactive forks on your github account.
brew "caarlos0/tap/fork-cleaner"
# quickly ssh into gcloud instances
brew "caarlos0/tap/gssh"
# Like gofmt, but for JSON files
brew "caarlos0/tap/jsonfmt"
# kubectx and kubens are power tools for kubectl
brew "caarlos0/tap/kubectx"
brew "caarlos0/tap/svu"
# The Clojure Programming Language
brew "clojure/tools/clojure"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
cask "1password"
cask "adoptopenjdk8"
cask "airflow"
cask "appcleaner"
cask "chefdk"
cask "deckset"
cask "discord"
cask "docker"
cask "figma"
cask "font-inconsolata"
cask "font-inconsolata-for-powerline"
cask "goland"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iina"
cask "imageoptim"
cask "intellij-idea-ce"
cask "iterm2-beta"
cask "java"
cask "keepingyouawake"
cask "keybase"
cask "kindle"
cask "logitech-options"
cask "monodraw"
cask "ngrok"
cask "notion"
cask "now"
cask "postgres"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "quitter"
cask "rectangle"
cask "signal"
cask "slack"
cask "subtitles"
cask "suspicious-package"
cask "telegram"
cask "transmission"
cask "twitch"
cask "visual-studio-code"
cask "webpquicklook"
cask "whatsapp"
